# YOLOv9

# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 0-P1/2
  
   # depth params module
   [-1, 1, DepthParamsModule, [32]],  # 1

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 2-P2/4

   # elan-1 block
   [-1, 1, ELAN1, [64, 64, 32]],  # 3

   # avg-conv down
   [-1, 1, AConv, [128]],  # 4-P3/8

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]],  # 5

   # avg-conv down
   [-1, 1, AConv, [192]],  # 6-P4/16

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]],  # 7

   # avg-conv down
   [-1, 1, AConv, [256]],  # 8-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]],  # 9
  ]

# elan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [256, 128]],  # 10

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # 12 cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]],  # 13

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # 15 cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]],  # 16

   # avg-conv-down merge
   [-1, 1, AConv, [96]],
   [[-1, 13], 1, Concat, [1]],  # 18 cat head P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]],  # 19 (P4/16-medium)

   # avg-conv-down merge
   [-1, 1, AConv, [128]],
   [[-1, 10], 1, Concat, [1]],  # 21 cat head P5

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]],  # 22 (P5/32-large)
   
   # elan-spp block
   [9, 1, SPPELAN, [256, 128]],  # 23

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # 25 cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]],  # 26

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # 28 cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]],  # 29

   # detect
   [[29, 26, 23, 16, 19, 22], 1, DualDDetect, [nc]],  # 30 Detect(P3, P4, P5)
  ]
